src/main/resources/available-samples/dtcc-samples/DDL_Assignment.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ ../../schemas/dtcc-11-0/OTC_Matching_11-0.xsd"
	xmlns:fpml="http://www.fpml.org/2010/FpML-4-9" xmlns:rm="OTC_RM_11-0"
	xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mtc="OTC_Matching_11-0">
<env:Header>
<!-- CONFIDENTIAL AND PROPRIETARY All rights reserved Copyright 2003,2004,2005 The Depository Trust & Clearing Corporation By receipt and review of these materials, the recipient acknowledges and agrees that these materials are and shall remain, and be treated and maintained by any recipient, as confidential and as such may not be disclosed. Further, the recipient agrees that all copyright and other intellectual property rights in or relating to these materials are and shall remain the property of DTCC. -->
<OTC_RM xmlns="OTC_RM_11-0">
<Manifest>
				<TradeMsg>
					<Activity>New</Activity>
					<Status>Confirmed</Status>
					<TransType>Assignment</TransType>
					<ProductType>CreditDefaultSwapShort</ProductType>
					<Submitter>
						<partyTradeIdentifier>
							<fpml:partyReference href="SKON0123" /> 
							<fpml:tradeId tradeIdScheme="TradeRefNbr">SP18_3Way_TRNReuse_A</fpml:tradeId> 
							<fpml:tradeId tradeIdScheme="DTCCTradeId">20180306.1000197819</fpml:tradeId> 
							<fpml:tradeId tradeIdScheme="TradeRefNbrSupplement">OLD_TRADE_RP_SUP200</fpml:tradeId> 
							<fpml:tradeId tradeIdScheme="ReservationId"></fpml:tradeId> 
							<fpml:tradeId tradeIdScheme="MCPTransactionID">MCPID_NEW_TRADE</fpml:tradeId> 
							<fpml:tradeId tradeIdScheme="EventProcessingId">10000</fpml:tradeId> 
						</partyTradeIdentifier>
					</Submitter>
					<ContraTradeId>
						<partyTradeIdentifier>
							 <fpml:partyReference href="SKON0559" /> 
							 <fpml:tradeId tradeIdScheme="TradeRefNbr">SP18_3Way_TRNReuse_B</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="DTCCTradeId">20180306.1000197819</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="TradeRefNbrSupplement">OLD_TRADE_OR_SUP121</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="ReservationId"></fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="MCPTransactionID">MCPID_NEW_TRADE</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="EventProcessingId">10001</fpml:tradeId> 
						</partyTradeIdentifier>
					</ContraTradeId>
					<ContraTradeId>
						<partyTradeIdentifier>
							 <fpml:partyReference href="SKON0007" /> 
							 <fpml:tradeId tradeIdScheme="TradeRefNbr">SKON0007_NEW_TR3</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="TradeRefNbrSupplement">SP18_3Way_TRNReuse_NewC</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="ReservationId"></fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="MCPTransactionID">MCPID_New_Trade_EE</fpml:tradeId> 
							 <fpml:tradeId tradeIdScheme="EventProcessingId">20001</fpml:tradeId> 
						</partyTradeIdentifier>
					</ContraTradeId>
					
					<!-- USI for the new trade. -->
					<USI>
							<USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">1017777777</USIIssuer>
							<USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">20000</USITradeId>
					</USI>
					<!-- USI for the old trade. In cases where the USI field differs for each side of a deal then the value for each side will be provided in the bilateral USI fields-->
					<OldUSI>
							<USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">1017777777</USIIssuer>
							<USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">20001</USITradeId>
							</OldUSI>
					<!-- USI for the Fee that has been reported separately to the GTR-->
					<FeeUSI>
					<USIIssuer issuerIdScheme="http://www.fpml.org/coding-scheme/external/cftc/issuer-identifier">1017777777</USIIssuer>
					<USITradeId tradeIdScheme="http://www.fpml.org/coding-scheme/external/unique-transaction-identifier">20002</USITradeId>
				</FeeUSI>
				</TradeMsg>
				<MsgId>123456-002700000000001</MsgId>
			</Manifest>
			<Delivery>
				<RouteInfo>
					<From>SKONSUB1</From>
					<To>DTCC</To>
				</RouteInfo>
				<RouteHist>
					<Route>
						<RouteAddress>www.requestoraddress.com</RouteAddress>
						<ReceiveTime>2007-10-31T18:08:40.335-05:00</ReceiveTime>
						<ReleaseTime>2007-10-31T18:08:40.335-05:00</ReleaseTime>
					</Route>
				</RouteHist>
			</Delivery>
		</OTC_RM>
	</env:Header>
	<env:Body>
		<!--  Start of Body  -->
		<OTC_Matching xmlns="OTC_Matching_11-0">
			<Activity>New</Activity>
			<Status>Confirmed</Status>
			<WarehouseState>
					<WarehouseStatus>Certain</WarehouseStatus>
					<WarehousePositionType>Gold</WarehousePositionType>
			</WarehouseState>
			<Assignment>
				<!-- The Remaining Party record must contain TWO trade elements. The first
				trade element represents the "Old Transaction" between the Remaining Party
				and the Transferor. The second trade element represents the "New Transaction"
				between the Remaining Party	and the . You must use the id attribute
				with the value "OldTransaction" for the first trade element. You must use
				the id attribute with the value "NewTransaction" for the second trade element. 
				-->
				<trade id="NewTransaction">
					<tradeHeader xmlns="http://www.fpml.org/2010/FpML-4-9">
						<partyTradeIdentifier>
							<!-- 
 party reference for the submitting firm.  
							The convention is to use id attribute from the party tag which defines 
							the submitting firm 

  -->
							<partyReference href="SKON0123"/>
							<tradeId tradeIdScheme="TradeRefNbr">SP18_3Way_TRNReuse_A</tradeId>
							<tradeId tradeIdScheme="MCPTransactionID">MCPID_NEW_TRADE_RPN</tradeId>
							<tradeId tradeIdScheme="EventProcessingId">20000</tradeId>
						</partyTradeIdentifier>
						<partyTradeIdentifier>
							<partyReference href="SKON0007"/>
							<tradeId tradeIdScheme="TradeRefNbr">SP18_3Way_TRNReuse_NewC</tradeId>
							<tradeId tradeIdScheme="MCPTransactionID">MCPID_New_Trade_EE</tradeId>
							<tradeId tradeIdScheme="EventProcessingId">20001</tradeId>
						</partyTradeIdentifier>
						<tradeDate>2017-06-13</tradeDate>
					</tradeHeader>
					<creditDefaultSwap xmlns="http://www.fpml.org/2010/FpML-4-9">
						<generalTerms>
							<effectiveDate>
								<!-- the "Effective Date" is to be in the unadjustedDate tag. The business day convention does not apply 'NotApplicable' for trades under master confirms (since the master confirm convention applies.) For StandardAsiaCorporate the effectiveDate must always be tradeDate+1 -->
								<unadjustedDate>2017-06-14</unadjustedDate>
								<dateAdjustments>
									<businessDayConvention>NotApplicable</businessDayConvention>
								</dateAdjustments>
							</effectiveDate>
							<scheduledTerminationDate>
								<!-- the "Scheduled Termination Date" is to be in the unadjustedDate tag. The business day convention does not apply 'NotApplicable' for trades under master confirms (since the master confirm convention applies.) For StandardAsiaCorporate the month and day portion of the date must one of the "03-20","06-20","09-20","12-20" -->
								<adjustableDate>
									<unadjustedDate>2022-03-20</unadjustedDate>
									<dateAdjustments>
										<businessDayConvention>NotApplicable</businessDayConvention>
									</dateAdjustments>
								</adjustableDate>
							</scheduledTerminationDate>
							<!-- Field name: "Floating Rate Payer ("Seller")" is the sellerPartyReference tag. This tag will be empty. The href attribute will be the DTCC participant number of the seller -->
							<sellerPartyReference href="SKON0123"/>
							<!-- Field name:"Fixed Rate Payer ("Buyer")" is the buyerPartyReference tag. This tag will be empty. The href attribute will be the DTCC participant number of the buyer -->
							<buyerPartyReference href="SKON0007"/>
							<referenceInformation>
								<referenceEntity>
									<entityName
										entityNameScheme="http://www.fpml.org/spec/2003/entity-name-RED"
										>PFIZED INC.</entityName>
									<entityId
										entityIdScheme="http://www.fpml.org/spec/2003/entity-id-RED"
										>21657K</entityId>
								</referenceEntity>
								<referenceObligation>
									<bond>
										<instrumentId
											instrumentIdScheme="http://www.fpml.org/spec/2002/instrument-id-ISIN"
											>US635405AQ55</instrumentId>
									</bond>
								</referenceObligation>
							</referenceInformation>
							<!-- Additional Terms is Optional. -->
							<additionalTerm
								additionalTermScheme="http://derivserv.dtcc.com/coding-scheme/additional-term"
							/>
						</generalTerms>
						<feeLeg>
							<!-- singlePayment represents a single fixed amount which the buyer pays to the seller ie Seller = Receiver and Buyer = Payer. This can be used in lieu of periodicPayment, or in conjunction with periodicPayment.-->
							<periodicPayment>
								<paymentFrequency>
									<!-- For StandardAsiaCorporate: paymentFrequency must be "3" "M"(months) -->
									<periodMultiplier>3</periodMultiplier>
									<period>M</period>
								</paymentFrequency>
								<!--For StandardAsiaCorporate, the firstPeriodStartDate will be Calculated based on the start of the previous roll. This should reflect the adjusted date.-->
								<firstPeriodStartDate>2017-03-20</firstPeriodStartDate>
								<!-- For StandardAsiaCorporate the firstPaymentDate element must be included and is always the next Quarterly Date; The submitted date must reflect the next Quarterly Date -->
								<firstPaymentDate>2017-06-20</firstPaymentDate>
								<rollConvention>20</rollConvention>
								<fixedAmountCalculation>
									<!-- Field name:"Fixed Rate" Per the FpML definition, the period fixed rate is a per annum rate, expressed as a decimal i.e. a fixed rate of 5% per year would be represented as 0.0500. For 100-500 Standard CDS must contain an equivalent of either 0.0100 or 0.0500. -->
									<fixedRate>0.0100</fixedRate>
								</fixedAmountCalculation>
							</periodicPayment>
						</feeLeg>
						<protectionTerms>
							<calculationAmount id="calculationAmount">
								<!-- Field name: "Calculation Amount Currency" is to be in the following currency tag. The currencyScheme must be specified and must be as shown below.-->
								<currency currencyScheme="http://www.fpml.org/ext/iso4217"
									>USD</currency>
								<amount>1000000</amount>
							</calculationAmount>
							<creditEvents>
								<!-- For StandardAsiaCorporate : restructuring is always applicable and stored as "true" -->
								<restructuring/>
							</creditEvents>
						</protectionTerms>
					</creditDefaultSwap>
					<fpml:calculationAgent>
						<fpml:calculationAgentPartyReference href="SKON0123"/>
					</fpml:calculationAgent>
					<!-- For StandardAsiaCorporate : calculationAgentBusinessCenter must equal "GBLO"for London -->
					<fpml:calculationAgentBusinessCenter
						businessCenterScheme="http://www.fpml.org/spec/2000/business-center"
						>GBLO</fpml:calculationAgentBusinessCenter>
					<collateral xmlns="http://www.fpml.org/2010/FpML-4-9">
						<independentAmount>
							<payerPartyReference href="SKON0123"/>
							<receiverPartyReference href="SKON0007"/>
							<paymentDetail>
								<paymentRule xsi:type="PercentageRule">
									<paymentPercent>.05</paymentPercent>
									<notionalAmountReference href="calculationAmount"/>
								</paymentRule>
							</paymentDetail>
						</independentAmount>
					</collateral>
					<documentation xmlns="http://www.fpml.org/2010/FpML-4-9">
						<masterAgreement>
							<masterAgreementType
								masterAgreementTypeScheme="http://dtcc.com/coding-scheme/master-agreement-type"
								>ISDA</masterAgreementType>
							<!-- Master Agreement Version is Optional. -->
							<masterAgreementVersion
								masterAgreementVersionScheme="http://www.fpml.org/coding-scheme/master-agreement-version"
								>2016</masterAgreementVersion>
							<masterAgreementDate>2003-10-01</masterAgreementDate>
						</masterAgreement>
						<contractualDefinitions
							contractualDefinitionsScheme="http://www.fpml.org/coding-scheme/contractual-definitions"
							>ISDA2014Credit</contractualDefinitions>
						<!-- For Transaction Type of StandardAsiaCorporate, Monoline provisions is not allowed -->
						<contractualMatrix>
							<matrixType
								matrixTypeScheme="http://www.fpml.org/coding-scheme/matrix-type"
								>CreditDerivativesPhysicalSettlementMatrix</matrixType>
							<publicationDate>2005-03-07</publicationDate>
							<matrixTerm
								matrixTermScheme="http://www.fpml.org/coding-scheme/credit-matrix-transaction-type"
								>StandardAsiaCorporate</matrixTerm>
						</contractualMatrix>
					</documentation>
				</trade>
				<AssignmentProvisions>
					<Transferor href="SKON0559"/>
					<Transferee href="SKON0007"/>
					<RemainingParty href="SKON0123"/>
					<!-- RemainingPartyTwo is optional for the Remaining Party record. The 
					RemainingPartyTwo field is not allowed for the Transferee and Transferor records
					-->
					<RemainingPartyTwo href="SKON0123"/>

					<NovationDate>2017-06-14</NovationDate>
					<NovatedAmount>
						<fpml:currency currencyScheme="http://www.fpml.org/ext/iso4217"
							>USD</fpml:currency>
						<fpml:amount>1000000</fpml:amount>
					</NovatedAmount>
					<!-- If "Full First Calculation Period" is "Applicable", 
					you can omit the FullFirstCalculationPeriod element or you
					can include it with the value "Applicable".
					If "Full First Calculation Period" is "NotApplicable", you
					must include the FullFirstCalculationPeriod element with the 
					value "NotApplicable".
					-->
					<FullFirstCalculationPeriod>NotApplicable</FullFirstCalculationPeriod>
				</AssignmentProvisions>
				<payment>
					<fpml:payerPartyReference href="SKON0559"/>
					<fpml:receiverPartyReference href="SKON0007"/>
					<fpml:paymentAmount>
						<fpml:currency currencyScheme="http://www.fpml.org/ext/iso4217"
							>USD</fpml:currency>
						<fpml:amount>595959</fpml:amount>
					</fpml:paymentAmount>
					<fpml:adjustedPaymentDate>2017-06-16</fpml:adjustedPaymentDate>
				</payment>
				<!-- There must be a "party" tag for the submitter and each contra party.  
				The "id" attribute must be the literal "DTCC" followed by the DTCC participant number.
				The "partyId" is a required child element which will be an element only with a
				required "partyIdScheme" of "DTCC"
				The value of the partyId tag will be the same as the party id attribute.
				For an Assignment, there must be three parties on the Transferor and
				Transferee records, and three or four parties on the Remaining Party record.
				-->
				<party id="SKON0559">
					<fpml:partyId partyIdScheme="DTCC">SKON0559</fpml:partyId>
				</party>
				<party id="SKON0123">
					<fpml:partyId partyIdScheme="DTCC">SKON0123</fpml:partyId>
				</party>
				<party id="SKON0007">
					<fpml:partyId partyIdScheme="DTCC">SKON0007</fpml:partyId>
				</party>
			</Assignment>
			<WorkflowData>
					<partyReference href="SKON0123"/>
					<!-- These are the designated party workflow fields -->
					<PartyWorkflowFields trade="NewTransaction">
						<comment>New DTCCDEMO0442 Trade for XXX notional</comment>
						<superId>ABC_PrechangedValue 1</superId>
						<deskId>DeskId 1</deskId>
						<eTradeId>DerivServ10_54</eTradeId>
						<designatedParty>ABC Clearing 1</designatedParty>
						<brokerName>BrokerName 1</brokerName>
						<branchLocation>water street 1</branchLocation>
					</PartyWorkflowFields>
			<!-- DTCC: We won't populate ContraWorkflowfields, as these are catered for in the explicit WorkflowData section for the designated Counterparty. -->
<!--<ContraWorkflowFields/>-->
				</WorkflowData>
<!-- WorkflowData sections per Party. Party identified by href-->
				<WorkflowData>
					<partyReference href="SKON0007"/>
<!-- These are the designated party workflow fields -->
					<PartyWorkflowFields trade="NewTransaction">
						<comment>New SKON0123 Trade for XXX notional</comment>
						<superId>ABC_PrechangedValue 2</superId>
						<deskId>DeskId 2</deskId>
						<eTradeId>DerivServ10_55</eTradeId>
						<designatedParty>ABC Clearing 2</designatedParty>
						<brokerName>BrokerName 2</brokerName>
						<branchLocation>water street 2</branchLocation>
						</PartyWorkflowFields>
<!-- DTCC: We won't populate ContraWorkflowfields, as these are catered for in the explicit WorkflowData section for the designated Party -->
<!--<ContraWorkflowFields/>-->
				</WorkflowData>
		</OTC_Matching>
		<!--  End of Body  -->
	</env:Body>
</env:Envelope>
